tutorials/incompressible/pisoFoam/ras/cavity/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
